# Напишите программу, которая принимает аргумент в виде списка и возвращает словарь, в котором каждый элемент
# списка является и ключом и значением. Предполагается, что элементы списка будут соответствовать
# правилам задания ключей в словарях.

a = [1,'hi',2,6,'3',7,4,'world']
d = dict([(1,1),('hi','hi'), (2,2), (6,6), ('3','3'), (7,7), (4,4), ('world','world')])
print(d)

