#Вывести все числа в диапазоне от 54 до 9184, кратные 5 через цикл for

for i in range(54,9184):
    if (int(i)%5)==0:
        print(i)

