# 1.Создайте кортеж с цифрами от 0 до 9 и посчитайте сумму
# 2. long_word = ( 'т', 'т', 'а', 'и', 'и', 'а', 'и’,'и', 'и', 'т', 'т', 'а', 'и', 'и','и', 'и', 'и', 'т', 'и’)

# a = (0,1,2,3,4,5,6,7,8,9)
# print(sum(a)) #сумма элементов кортежа

long_word = ('т','т','а','и','и','а','и','и','и','т','т','а','и','и','и','и','и','т','и')
print(len(long_word)) #длина long_word
print(long_word.count('т')) #число повторений 'т'
print(long_word.count('а')) #число повторений 'а'
print(long_word.count('и')) #число повторений 'и'
